app/views/pets/_form.html.erb

SELECT "doctors".* FROM "doctors"
---
    <%= f.label :doctor %><br>
    <%= f.collection_select(:doctor_id, Doctor.all, :id, :name) %>