app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("created_at", "customer", "date_of_visit", "pet", "reason", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save