app/controllers/authentication_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 11 Sep 2015 15:17:43 UTC +00:00], ["updated_at", Fri, 11 Sep 2015 15:17:43 UTC +00:00]]
---
  def register
	  @user = User.new(user_params)

	  if @user.valid?
	    @user.save