app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("address", "city", "created_at", "name", "school", "state", "updated_at", "years_in_practice", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save