app/controllers/pets_controller.rb

INSERT INTO "pets" ("age", "breed", "created_at", "doctor_id", "last_visit", "name", "pet_type", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save